Autodesk.Revit.DB.Lighting.ColorPreset
Preset values of initial colors for specific lighting types
Since:
2013

Autodesk.Revit.DB.Lighting.ColorPreset.PhosphorMercury
Phosphor mercury.

Autodesk.Revit.DB.Lighting.ColorPreset.Mercury
Mercury.

Autodesk.Revit.DB.Lighting.ColorPreset.LowPressureSodium
Low pressure sodium.

Autodesk.Revit.DB.Lighting.ColorPreset.HighPressureSodium
High pressure sodium.

Autodesk.Revit.DB.Lighting.ColorPreset.MetalHalide
Metal halide.

Autodesk.Revit.DB.Lighting.ColorPreset.FluorescentLightWhite
F4 fluorescent light white.

Autodesk.Revit.DB.Lighting.ColorPreset.FluorescentDayLight
F4 fluorescent day light.

Autodesk.Revit.DB.Lighting.ColorPreset.FluorescentWhite
F4 fluorescent white.

Autodesk.Revit.DB.Lighting.ColorPreset.FluorescentCool
F4 fluorescent cool white.

Autodesk.Revit.DB.Lighting.ColorPreset.FluorescentWarm
F4 fluorescent warm white.

Autodesk.Revit.DB.Lighting.ColorPreset.Quartz
Quartz.

Autodesk.Revit.DB.Lighting.ColorPreset.Xenon
Xenon.

Autodesk.Revit.DB.Lighting.ColorPreset.Incandescent
Incandescent.

Autodesk.Revit.DB.Lighting.ColorPreset.Halogen
Halogen.

Autodesk.Revit.DB.Lighting.ColorPreset.D50
D50.

Autodesk.Revit.DB.Lighting.ColorPreset.D65
D65.